## Briefest of Intros to Pandas

[Pandas](https://pandas.pydata.org/) is an open-source "data analysis and manipulation tool" most widely known for its dataframe feature. A **dataframe** is essentially a two-dimensional table of any size; pandas has built in features to analyze and visualize that data.

In [3]:
# pandas is an external library you can import, typically "as pd"
import pandas as pd

In [4]:
# create a simple dataset
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Chicago', 'San Francisco', 'Boston']
}

### What do you notice about this dictionary?

In [6]:
data["Name"][0]

'Alice'

In [7]:
# Convert the dictionary to a pandas DataFrame
df = pd.DataFrame(data)

In [8]:
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30        Chicago
2  Charlie   35  San Francisco
3    Diana   40         Boston

In [20]:
# Some typical pandas operations

df.head(2)  # Display the first few rows of the DataFrame

    Name  Age      City
0  Alice   25  New York
1    Bob   30   Chicago

In [10]:
df.describe()  # Get a statistical summary of the DataFrame

             Age
count   4.000000
mean   32.500000
std     6.454972
min    25.000000
25%    28.750000
50%    32.500000
75%    36.250000
max    40.000000

In [11]:
df['Age']  # Access a single column

0    25
1    30
2    35
3    40
Name: Age, dtype: int64

In [12]:
df[['Name', 'City']]  # Access multiple columns

      Name           City
0    Alice       New York
1      Bob        Chicago
2  Charlie  San Francisco
3    Diana         Boston

In [14]:
df.iloc[0]  # Access a single row by index

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [15]:
df.iloc[0:2]  # Access multiple rows by index

    Name  Age      City
0  Alice   25  New York
1    Bob   30   Chicago

In [16]:
df[df['Age'] > 30]  # Filter rows based on a condition

      Name  Age           City
2  Charlie   35  San Francisco
3    Diana   40         Boston

In [17]:
df['Age'].mean()  # Calculate the mean of a column

np.float64(32.5)

In [18]:
df['Age'].sum()  # Calculate the sum of a column

np.int64(130)